Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
#if defined(MEAS_PREEMPTION_TIME)
void StartPreemptionTimeTaskA(void const * argument)
{
	int i = 0;
	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreA_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreB_xSemaphore);
			for(i=0;i<LOW_PRIORITY_TASK_LOOP_DELAY;i++){}
		}
	}
}

void StartPreemptionTimeTaskB(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreB_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreC_xSemaphore);
			osDelay(11);
			for(i=0;i<MEDIUM_PRIORITY_TASK_LOOP_DELAY;i++){}
		}
	}
}

void StartPreemptionTimeTaskC(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreC_xSemaphore, portMAX_DELAY) == osOK)
		{
			osDelay(23);
			for(i=0;i<HIGH_PRIORITY_TASK_LOOP_DELAY;i++){}
		}
	}
}
#endif // defined(MEAS_PREEMPTION_TIME)

#if defined(MEAS_INTERRUPT_LATENCY_TIME)
void StartInterruptLatencyTimeTask(void const * argument)
{
	osSemaphoreDef(INTSEM);
	interruptLatency_xSemaphore = osSemaphoreCreate(osSemaphore(INTSEM), 1);

	while(1)
	{
		if(osSemaphoreWait(interruptLatency_xSemaphore, portMAX_DELAY) == osOK)
		{
			__asm volatile
			(
			"	push {r0, r1, r2}								\n"
			"   movw r0, #0x0810								\n"/* GPIOC címének betöltése */
			"	movt r0, #0x4002								\n"
			"   ldr r1, [r0, #0]								\n"/* PORTC értékének betöltése */
			" 	lsr r1, r1, #10									\n"/* Bit helyre mozgatása */
			" 	and r1, r1, #0x00000008							\n"/* Maszkolások */
			"   movw r0, #0x0C14								\n"/* GPIOD címének betöltése */
			"	movt r0, #0x4002								\n"
			" 	ldr r2, [r0, #0]								\n"
			" 	and r2, r2, #0xFFFFFFF7							\n"
			" 	orr r2, r2, r1									\n"
			" 	str r2, [r0, #0]								\n"/* Érték kihelyezése a lábra */
			"	pop {r0, r1, r2}								\n"
			);
		}
	}
}
#endif // defined(MEAS_INTERRUPT_LATENCY_TIME)

#if defined(MEAS_SEMAPHORE_SHUFFLING_TIME)
void StartSemaphoreShufflingTimeTaskA(void const * argument)
{
	int i = 0;

	osSemaphoreDef(SEMSHUFSEM);
	semaphoreShuffling_xSemaphore = osSemaphoreCreate(osSemaphore(SEMSHUFSEM), 1);

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreA_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreB_xSemaphore);
			if(osSemaphoreWait(semaphoreShuffling_xSemaphore, portMAX_DELAY) == osOK)
			{
				for(i=0;i<MEDIUM_PRIORITY_TASK_LOOP_DELAY;i++){}
				osSemaphoreRelease(semaphoreShuffling_xSemaphore);
			}
		}
	}
}

void StartSemaphoreShufflingTimeTaskB(void const * argument)
{
	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreB_xSemaphore, portMAX_DELAY) == osOK)
		{
			osDelay(10);
			if(osSemaphoreWait(semaphoreShuffling_xSemaphore, portMAX_DELAY) == osOK)
			{
				osSemaphoreRelease(semaphoreShuffling_xSemaphore);
			}
		}
	}
}
#endif // defined(MEAS_SEMAPHORE_SHUFFLING_TIME)

#if defined(MEAS_DEADLOCK_BREAKING_TIME)
void StartDeadlockBreakingTimeTaskA(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreA_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreB_xSemaphore);
			if(osMutexWait(deadlockBreaking_xMutex, portMAX_DELAY) == osOK)
			{
				for(i=0;i<LOW_PRIORITY_TASK_LOOP_DELAY;i++){}
				osMutexRelease(deadlockBreaking_xMutex);
			}
		}
	}
}

void StartDeadlockBreakingTimeTaskB(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreB_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreC_xSemaphore);
			osDelay(11);
			for(i=0;i<MEDIUM_PRIORITY_TASK_LOOP_DELAY;i++){}
		}
	}
}

void StartDeadlockBreakingTimeTaskC(void const * argument)
{
	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreC_xSemaphore, portMAX_DELAY) == osOK)
		{
			osDelay(23);
			if(osMutexWait(deadlockBreaking_xMutex, portMAX_DELAY) == osOK)
			{
				osMutexRelease(deadlockBreaking_xMutex);
			}
		}
	}
}
#endif // defined(MEAS_DEADLOCK_BREAKING_TIME)

#if defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
void StartDatagramThroughputTimeTaskA(void const * argument)
{
	osSemaphoreDef(DATAGRAMSEM);
	datagramThroughput_xSemaphore = osSemaphoreCreate(osSemaphore(DATAGRAMSEM), 1);
	osMessageQDef(DATAGRAMMES, 128, uint32_t);
	datagramThrougput_xMessage = osMessageCreate(osMessageQ(DATAGRAMMES), NULL);

	uint32_t i = 0;
	uint32_t temp;
	osEvent event;

	while(1)
	{
		if(osSemaphoreWait(datagramThroughput_xSemaphore, portMAX_DELAY) == osOK)
		{
			if(osSemaphoreWait(measureSemaphoreA_xSemaphore, portMAX_DELAY) == osOK)
			{
				osSemaphoreRelease(measureSemaphoreB_xSemaphore);
				for(i=0;i<128;i++)
				{
					event = osMessageGet(datagramThrougput_xMessage, portMAX_DELAY);
					if(event.status == osEventMessage)
					{
						temp = (uint32_t)event.value.p;
						if(temp != i)
							return;
						// ToDo: Láb állítása
					}
				}
				osSemaphoreRelease(datagramThroughput_xSemaphore);
				portYIELD();
			}
		}
	}
}

void StartDatagramThroughputTimeTaskB(void const * argument)
{
	uint32_t i = 0;
	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreB_xSemaphore, portMAX_DELAY) == osOK)
		{
			// OUT láb magasba állítása
			__asm volatile
			(
			"	push {r0, r1, r2}								\n"
			"   movw r0, #0x0C14								\n" /* GPIOD címének betöltése */
			"	movt r0, #0x4002								\n"
			" 	ldr r2,[r0, #0]									\n"
			" 	orr r2, r2, #0x00000008							\n"
			" 	str r2, [r0, #0]								\n" /* Magas érték kiírása az OUT lábra */
			"	pop {r0, r1, r2}								\n"
			);
			for(i=0;i<128;i++)
			{
				osMessagePut(datagramThrougput_xMessage, i, portMAX_DELAY);
			}
			if(osSemaphoreWait(datagramThroughput_xSemaphore, portMAX_DELAY) == osOK)
				osSemaphoreRelease(datagramThroughput_xSemaphore);
			// OUT láb alacsonyba állítása
			__asm volatile
			(
			"	push {r0, r1, r2}								\n"
			"   movw r0, #0x0C14								\n" /* GPIOD címének betöltése */
			"	movt r0, #0x4002								\n"
			" 	ldr r2,[r0, #0]									\n"
			" 	and r2, r2, #0xFFFFFFF7							\n"
			" 	str r2, [r0, #0]								\n" /* Alacsony érték kiírása az OUT lábra */
			"	pop {r0, r1, r2}								\n"
			);
		}
	}
}
#endif // defined(MEAS_DATAGRAM_THROUGHPUT_TIME)

#if defined(BLINKING_LED)
void StartForwardLEDTask(void const * argument)
{
	while(1)
	  {
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_12);
		osDelay(400);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_13);
		osDelay(500);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
		osDelay(600);
	  }
}

void StartReverseLEDTask(void const * argument)
{
	while(1)
	  {
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
		osDelay(100);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_13);
		osDelay(200);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_12);
		osDelay(300);
	  }
}
#endif // defined(BLINKING_LED)

