Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
#if defined(MEAS_W_LOAD)
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *UartHandle)
{
	if (UartHandle->Instance == USART6)
		osSemaphoreRelease(uart6_xSemaphore);
}

void StartSwitchChangedTask(void const * argument)
{
	GPIO_PinState sw0_state = GPIO_PIN_RESET;
	GPIO_PinState sw1_state = GPIO_PIN_RESET;
	uint16_t gpioPin = 0;
	osEvent event;

	osMessageQDef(SWITCHMES, 1, uint16_t);
	switchInterrupt_xMessage = osMessageCreate(osMessageQ(SWITCHMES), NULL);

	sw0_state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_10);
	sw1_state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_11);

	while(1)
	{
		event = osMessageGet(switchInterrupt_xMessage, portMAX_DELAY);

		if(event.status == osEventMessage)
		{
			gpioPin = (uint16_t)event.value.p;

			if(gpioPin == GPIO_PIN_10)
				sw0_state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_10);
			else if(gpioPin == GPIO_PIN_11)
				sw1_state = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_11);
		}
		// ToDo: Érték kiküldése soros porton.
		osDelay(100);
	}
}

void StartTempMeasureTask(void const * argument)
{
	uint32_t adc_val = 0;

	while(1)
	{
		HAL_ADC_Start(&hadc1);
		if(HAL_ADC_PollForConversion(&hadc1, portMAX_DELAY) == HAL_OK)
		{
			adc_val = HAL_ADC_GetValue(&hadc1);
		}
		else
		{
			adc_val = 0xFFFFFFFF;
		}
		// ToDo: Érték kiküldése soros porton.
		osDelay(100);
	}
}

void StartPotmeterMeasureTask(void const * argument)
{
	uint32_t adc_val = 0;

	while(1)
	{
		HAL_ADC_Start(&hadc2);
		if(HAL_ADC_PollForConversion(&hadc2, portMAX_DELAY) == HAL_OK)
		{
			adc_val = HAL_ADC_GetValue(&hadc2);
		}
		else
		{
			adc_val = 0xFFFFFFFF;
		}
		// ToDo: Érték kiküldése soros porton.
		osDelay(100);
	}
}

void StartBLETask(void const * argument)
{
	while(1)
	{
		// ToDo: Taszk implementálása.
		osDelay(1000);
	}
}

void StartUART6Task(void const * argument)
{
	uint8_t data[1];
	uint16_t size = sizeof(data)/sizeof(uint8_t);

	osSemaphoreDef(SEM);
	uart6_xSemaphore = osSemaphoreCreate(osSemaphore(SEM), 1);

	osSemaphoreWait(uart6_xSemaphore, 0);
	while(1)
	{
		HAL_UART_Receive_IT(&huart6, data, size);
		if(osSemaphoreWait(uart6_xSemaphore, portMAX_DELAY) == osOK)
		{
			HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
			HAL_UART_Transmit(&huart6, data, size, 100);
		}
		else
		{
			HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
		}
	}
	// ToDo: Az UART6 felelõs a GUI-val való kommunikációért, ezért ezt a taszkot mindenképp módosítani kell majd.
}

void StartSDCardTask(void const * argument)
{
	while(1)
	{
		// ToDo: Taszk implementálása.
		osDelay(1000);
	}
}
#endif // defined(MEAS_W_LOAD)
/* USER CODE END 4 */

/* StartStartMeasureTask function */
void StartStartMeasureTask(void const * argument)
{
  /* init code for FATFS */
#if defined(MEAS_W_LOAD)
  MX_FATFS_Init();
#endif // defined(MEAS_W_LOAD)

  /* USER CODE BEGIN 5 */

  /* Infinite loop */
  while(1)
  {
#if defined(MEAS_TASK_SWITCHING_TIME) || defined(MEAS_PREEMPTION_TIME) \
	|| defined(MEAS_SEMAPHORE_SHUFFLING_TIME) || defined(MEAS_DEADLOCK_BREAKING_TIME) || defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
	  osSemaphoreRelease(measureSemaphoreA_xSemaphore);
#endif // defined(MEAS_TASK_SWITCHING_TIME) || defined(MEAS_PREEMPTION_TIME)
//|| defined(MEAS_SEMAPHORE_SHUFFLING_TIME) || defined(MEAS_DEADLOCK_BREAKING_TIME) || defined(MEAS_DATAGRAM_THROUGHPUT_TIME)

    osDelay(100);
  }
  /* USER CODE END 5 */ 
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
